# #30: Akses nilai variabel pada `query()`

## Import Modules

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

## Persiapan Data Frame

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  15   6  15  15   1
1  14  14   7   1  18
2   5   6   9   3  13
3   8   5  14  17   1
4  12  12  11  14  11

## Akses nilai variabel pada `query()`

In [10]:
df.query('A > 5')

    A   B   C   D   E
0  15   6  15  15   1
1  14  14   7   1  18
3   8   5  14  17   1
4  12  12  11  14  11

In [12]:
df.query('A > 10')

    A   B   C   D   E
0  15   6  15  15   1
1  14  14   7   1  18
4  12  12  11  14  11

In [14]:
rerata = df['A'].mean()
rerata

10.8

In [16]:
df.query('A > @rerata')

    A   B   C   D   E
0  15   6  15  15   1
1  14  14   7   1  18
4  12  12  11  14  11